# Используем официальный образ Node.js в качестве базового образа
FROM node:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json (или yarn.lock) для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы проекта в рабочую директорию контейнера
COPY . .

# Определяем порт, который будет открыт в контейнере
EXPOSE 5000

# Команда, которая будет выполнена при запуске контейнера
CMD ["npm", "start"]